In [1]:
import pandas as  pd
import numpy as np

In [2]:
s = pd.Series([0,1,2,3,4,5])

In [4]:
s

0    0
1    1
2    2
3    3
4    4
5    5
dtype: int64

In [5]:
s.sample() #with no arguments

5    5
dtype: int64

In [6]:
s.sample(n = 3)

0    0
3    3
1    1
dtype: int64

In [7]:
s.iloc[0:4]

0    0
1    1
2    2
3    3
dtype: int64

In [7]:
s.sample(n=3, replace=False)

1    1
3    3
0    0
dtype: int64

In [8]:
s.sample(n=3, replace=True)

5    5
2    2
1    1
dtype: int64

In [9]:
#uysing weights such that each row has a differetnt probabiity of being pickedup in the sample
example_weights = [0,0,0.2,0.2,0.2,0.4]
s.sample(n=3, weights=example_weights)

5    5
2    2
4    4
dtype: int64

In [10]:
df2 = pd.DataFrame({'one':[9,8,7,6],'weight_column':[0.5,0.4,0.1,0]})

In [12]:
df2.sample(n=3, weights='weight_column')

   one  weight_column
0    9            0.5
1    8            0.4
2    7            0.1

In [14]:
#sampling columns instead of rows
df2.sample(n=1, axis=1)

   weight_column
0            0.5
1            0.4
2            0.1
3            0.0

In [15]:
#setting with enlargement i.e is like adding rows and columns
se = pd.Series([1,2,3])

In [17]:
se[2]

3

In [18]:
se[5] = 5
se

0    1
1    2
2    3
5    5
dtype: int64

In [21]:
#for a dataframe
df1 = pd.DataFrame(np.arange(6).reshape(3,2),columns=["A", "B"])

In [22]:
df1

   A  B
0  0  1
1  2  3
2  4  5

In [23]:
df1.loc[:,'C'] = df1.loc[:,'A'] ; df1

   A  B  C
0  0  1  0
1  2  3  2
2  4  5  4

In [24]:
#scalar value getting and setting
s

0    0
1    1
2    2
3    3
4    4
5    5
dtype: int64

In [25]:
s.iat[5]

5

In [26]:
s.at[5]

5

In [28]:
df = pd.DataFrame(np.random.randn(5,4), columns=["A","B","C","D"], index=pd.date_range('20180801', periods=5)); df

                   A         B         C         D
2018-08-01  0.544318 -0.068872 -0.714579 -1.580584
2018-08-02 -1.418430  0.399126  2.141231  0.778578
2018-08-03 -0.362762  0.077359 -0.288639  0.460756
2018-08-04 -0.403513  0.098416 -0.566999 -0.737493
2018-08-05  1.929520 -0.691542 -0.835199  0.761092

In [29]:
df.at[dates[5], 'A']

NameError: name 'dates' is not defined

In [30]:
df.iat[3,0]

-0.40351325778954517

In [32]:
#boolean indexing
s[s>1]

2    2
3    3
4    4
5    5
dtype: int64

In [33]:
s[(s <= 1) | (s > 0.5)]

0    0
1    1
2    2
3    3
4    4
5    5
dtype: int64

In [34]:
s[~(s<0)]

0    0
1    1
2    2
3    3
4    4
5    5
dtype: int64

In [35]:
#rows can also be selected form a dataframe using boolean
df[df['A'] > 0]

                   A         B         C         D
2018-08-01  0.544318 -0.068872 -0.714579 -1.580584
2018-08-05  1.929520 -0.691542 -0.835199  0.761092

In [37]:
df3 = pd.DataFrame({'a' : ['one', 'one', 'two', 'three', 'two', 'one', 'six'],
                   'b' : ['x', 'y', 'y', 'x','y','y','x'],
                   'c' : np.random.rand(7)})

In [38]:
df3

       a  b         c
0    one  x  0.864794
1    one  y  0.019661
2    two  y  0.206478
3  three  x  0.122192
4    two  y  0.272613
5    one  y  0.050525
6    six  x  0.400449

In [40]:
#criterion for selecting 'two' or 'three' in column one
criterion = df3['a'].map(lambda x: x.startswith('t'))
df3[criterion]

       a  b         c
2    two  y  0.206478
3  three  x  0.122192
4    two  y  0.272613

In [42]:
#equivalent but slower
df3[[x.startswith('t') for x in df3['a']]]

       a  b         c
2    two  y  0.206478
3  three  x  0.122192
4    two  y  0.272613

In [44]:
#multiple criterion
df3[criterion & (df3['b'] == 'x')]

       a  b         c
3  three  x  0.122192

In [45]:
#you can use locs to select more than one column axes
df3.loc[criterion & (df3['b'] == 'x'), 'b':'c' ]

   b         c
3  x  0.122192

In [46]:
#is in
s = pd.Series(np.arange(5), index=np.arange(5)[::-1], dtype='int64')

In [47]:
s

4    0
3    1
2    2
1    3
0    4
dtype: int64

In [48]:
s.isin([2,4,6])

4    False
3    False
2     True
1    False
0     True
dtype: bool

In [49]:
s[s.isin([2,4,6])]

2    2
0    4
dtype: int64

In [50]:
#we can use indesx method for this purpose
s[s.index.isin([2,4,6])]

4    0
2    2
dtype: int64

In [ ]:
#for multiindex i will deap with it later

In [51]:
df = pd.DataFrame({'vals': [1,2,3,4], 'ids': ['a','b','f','n'], 'id2': ['a','n','c','n']}); df

  id2 ids  vals
0   a   a     1
1   n   b     2
2   c   f     3
3   n   n     4

In [52]:
values = ['a','b',3]
df.isin(values)

     id2    ids   vals
0   True   True  False
1  False   True  False
2  False  False   True
3  False  False  False

In [53]:
#matching certain values with certain columns
values = {'ids': ['a', 'b'],'vals': [1,3]}
df.isin(values)

     id2    ids   vals
0  False   True   True
1  False   True  False
2  False  False   True
3  False  False  False

In [55]:
s.where(s>0) # s[s>0]

4    NaN
3    1.0
2    2.0
1    3.0
0    4.0
dtype: float64

In [56]:
df.where(df<0) #df[df<0]

  id2 ids  vals
0   a   a   NaN
1   n   b   NaN
2   c   f   NaN
3   n   n   NaN

In [58]:
df1

   A  B  C
0  0  1  0
1  2  3  2
2  4  5  4

In [62]:
df1.where(df1 < 0, -df1)

   A  B  C
0  0 -1  0
1 -2 -3 -2
2 -4 -5 -4

In [63]:
s2 = s.copy();s2

4    0
3    1
2    2
1    3
0    4
dtype: int64

In [64]:
s2[s2 < 0] = 0

In [65]:
s2

4    0
3    1
2    2
1    3
0    4
dtype: int64

In [66]:
df4 = df1.copy(); df4

   A  B  C
0  0  1  0
1  2  3  2
2  4  5  4

In [68]:
df4[df4<4] = 0; df4

   A  B  C
0  0  0  0
1  0  0  0
2  4  5  4

In [69]:
df_orig = df1.copy()
df_orig

   A  B  C
0  0  1  0
1  2  3  2
2  4  5  4

In [72]:
df_orig.where(df1 > 0, -df1, inplace=True)

In [73]:
df_orig

   A  B  C
0  0  1  0
1  2  3  2
2  4  5  4

In [79]:
df1.where(df1>0, df1['A'], axis='index')

   A  B  C
0  0  1  0
1  2  3  2
2  4  5  4

In [80]:
#mask
s.mask(s >= 0)

4   NaN
3   NaN
2   NaN
1   NaN
0   NaN
dtype: float64

In [81]:
df1.mask(df1 >= 0)

    A   B   C
0 NaN NaN NaN
1 NaN NaN NaN
2 NaN NaN NaN

In [3]:
n = 10
df = pd.DataFrame(np.random.rand(n,3), columns=list('abc')) ; df

          a         b         c
0  0.430216  0.837837  0.886817
1  0.770459  0.989986  0.706498
2  0.660139  0.789650  0.790350
3  0.233067  0.926879  0.454545
4  0.394642  0.067690  0.079597
5  0.230620  0.694419  0.243723
6  0.174376  0.678170  0.897436
7  0.874891  0.897905  0.250726
8  0.392846  0.780683  0.840813
9  0.464664  0.542608  0.122985

In [83]:
df[(df.a < df.b) & (df.b < df.c)]

          a         b         c
2  0.334899  0.351799  0.408218

In [84]:
df.query('(a < b) & (b < c)')

          a         b         c
2  0.334899  0.351799  0.408218

In [5]:
df.query('a < b & b < c ')

          a         b         c
0  0.430216  0.837837  0.886817
2  0.660139  0.789650  0.790350
6  0.174376  0.678170  0.897436
8  0.392846  0.780683  0.840813

In [4]:
#using index if you dont have a ne=named index.if column name and index name have the same name column name is given precedence
df.query('index < b < c')

          a         b         c
0  0.430216  0.837837  0.886817

In [2]:
#multiindex query
n = 10
colors = np.random.choice(['red', 'green'], size= n)
foods = np.random.choice(['eggs', 'ham'], size = n)

In [3]:
colors

array(['red', 'red', 'red', 'red', 'green', 'red', 'green', 'red', 'red',
       'green'], dtype='<U5')

In [4]:
foods

array(['ham', 'ham', 'ham', 'ham', 'ham', 'ham', 'ham', 'ham', 'ham',
       'eggs'], dtype='<U4')

In [5]:
index = pd.MultiIndex.from_arrays([colors, foods],names=['color', 'food']); index

MultiIndex(levels=[['green', 'red'], ['eggs', 'ham']],
           labels=[[1, 1, 1, 1, 0, 1, 0, 1, 1, 0], [1, 1, 1, 1, 1, 1, 1, 1, 1, 0]],
           names=['color', 'food'])

In [10]:
df = pd.DataFrame(np.random.randn(n,2), index = index); df

                   0         1
color food
red   ham  -0.271161  0.833585
      ham  -1.650587 -1.827291
      ham   1.101813  2.140224
      ham   2.546733 -0.135943
green ham   0.466211  0.188039
red   ham  -0.585585  1.469962
green ham   0.361245 -1.245384
red   ham  -0.588690  0.612854
      ham  -1.797214  0.465068
green eggs  0.262191  1.517098

In [9]:
df.query('color == "red"')

                   0         1
color food
red   ham  -0.194405  0.891316
      ham   0.503075  0.422294
      ham  -1.483448 -1.311139
      ham   1.596566 -0.595230
      ham  -1.053917  0.426500
      ham   0.779374  1.188836
      ham   0.525710 -0.380877

In [11]:
df.index.names

FrozenList(['color', 'food'])

In [12]:
#the in and not in operator
df = pd.DataFrame({'a': list('aabbccddeeff'),'b': list('aaaabbbbcccc'),'c': np.random.randint(5,size=12),
                  'd': np.random.randint(9, size=12)})
df

    a  b  c  d
0   a  a  3  1
1   a  a  3  5
2   b  a  2  3
3   b  a  3  5
4   c  b  1  6
5   c  b  0  5
6   d  b  0  6
7   d  b  2  1
8   e  c  3  1
9   e  c  4  5
10  f  c  4  7
11  f  c  0  1

In [13]:
df.query('a in b')

   a  b  c  d
0  a  a  3  1
1  a  a  3  5
2  b  a  2  3
3  b  a  3  5
4  c  b  1  6
5  c  b  0  5

In [14]:
#querying in pure python
df[df.a.isin(df.b)]

   a  b  c  d
0  a  a  3  1
1  a  a  3  5
2  b  a  2  3
3  b  a  3  5
4  c  b  1  6
5  c  b  0  5

In [16]:
df.query('a not in b')

    a  b  c  d
6   d  b  0  6
7   d  b  2  1
8   e  c  3  1
9   e  c  4  5
10  f  c  4  7
11  f  c  0  1

In [17]:
#in pure python
df[~df.a.isin(df.b)]

    a  b  c  d
6   d  b  0  6
7   d  b  2  1
8   e  c  3  1
9   e  c  4  5
10  f  c  4  7
11  f  c  0  1

In [18]:
df.query('a in b and c < d')

   a  b  c  d
1  a  a  3  5
2  b  a  2  3
3  b  a  3  5
4  c  b  1  6
5  c  b  0  5

In [19]:
df[(df.a.isin(df.b) & (df.c < df.d))]

   a  b  c  d
1  a  a  3  5
2  b  a  2  3
3  b  a  3  5
4  c  b  1  6
5  c  b  0  5

In [2]:
#drop duplicates
df = pd.DataFrame({'a': ['one', 'one', 'two', 'two', 'two', 'three', 'four'],
                  'b' : ['x', 'y', 'x', 'y', 'x', 'x', 'y'],
                  'c' : np.random.randn(7)})
df

       a  b         c
0    one  x  0.042546
1    one  y  0.478892
2    two  x -0.152066
3    two  y -0.325577
4    two  x  0.970039
5  three  x  0.373898
6   four  y  0.608992

In [3]:
df.duplicated('a')

0    False
1     True
2    False
3     True
4     True
5    False
6    False
dtype: bool

In [4]:
df.duplicated('a', keep='last')

0     True
1    False
2     True
3     True
4    False
5    False
6    False
dtype: bool

In [5]:
df.duplicated('a', keep=False)

0     True
1     True
2     True
3     True
4     True
5    False
6    False
dtype: bool

In [6]:
df.drop_duplicates('a')

       a  b         c
0    one  x  0.042546
2    two  x -0.152066
5  three  x  0.373898
6   four  y  0.608992

In [7]:
df.drop_duplicates('a', keep='last')

       a  b         c
1    one  y  0.478892
4    two  x  0.970039
5  three  x  0.373898
6   four  y  0.608992

In [8]:
df.drop_duplicates('a', keep=False)

       a  b         c
5  three  x  0.373898
6   four  y  0.608992

In [9]:
#for multiple columns
df.duplicated(['a', 'b'])

0    False
1    False
2    False
3    False
4     True
5    False
6    False
dtype: bool

In [10]:
df.drop_duplicates(['a', 'b'])

       a  b         c
0    one  x  0.042546
1    one  y  0.478892
2    two  x -0.152066
3    two  y -0.325577
5  three  x  0.373898
6   four  y  0.608992

In [12]:
#removing index duplicating
df3 = pd.DataFrame({'a': np.arange(6), 'b': np.random.randn(6)}, index=['a','a','b','c','b','a']);df3

   a         b
a  0  0.842225
a  1 -0.998509
b  2 -0.399844
c  3  0.591754
b  4 -0.527914
a  5 -0.231121

In [13]:
df3.index.duplicated()

array([False,  True, False, False,  True,  True])

In [14]:
df3[~df3.index.duplicated()]

   a         b
a  0  0.842225
b  2 -0.399844
c  3  0.591754

In [15]:
df3[~df3.index.duplicated(keep = 'last')]

   a         b
c  3  0.591754
b  4 -0.527914
a  5 -0.231121

In [16]:
df3[~df3.index.duplicated(keep = False)]

   a         b
c  3  0.591754

In [17]:
#get method  which is dictionary likes 
s = pd.Series([1,2,3], index = ['a', 'b', 'c']) ; s

a    1
b    2
c    3
dtype: int64

In [18]:
s.get('a') #equivalent to s['a']. works for both series, dataframe and panel

1

In [19]:
s.get('a', default=-1)

1

In [20]:
#the select method. should be used when you cannot call directly
df.select(lambda x: x == 'a', axis=1)

       a
0    one
1    one
2    two
3    two
4    two
5  three
6   four

In [22]:
#lookup method
dflookup = pd.DataFrame(np.random.rand(20,4), columns=['A', 'B', 'C', 'D'])

In [23]:
dflookup

           A         B         C         D
0   0.171685  0.960899  0.651658  0.285896
1   0.257594  0.706627  0.004427  0.726358
2   0.129709  0.816325  0.339866  0.642245
3   0.386073  0.233720  0.113823  0.558697
4   0.712847  0.517490  0.043712  0.015225
5   0.763758  0.919342  0.576839  0.505468
6   0.306849  0.125108  0.566407  0.420202
7   0.734269  0.167343  0.940871  0.238000
8   0.383154  0.384704  0.253603  0.373858
9   0.779751  0.305736  0.006011  0.313181
10  0.974691  0.563073  0.151809  0.461990
11  0.121074  0.835901  0.647777  0.879295
12  0.859744  0.309570  0.375067  0.298265
13  0.436647  0.281737  0.295903  0.155094
14  0.026717  0.435395  0.036341  0.165511
15  0.672459  0.657748  0.541568  0.641799
16  0.355659  0.241953  0.443135  0.351747
17  0.121048  0.591337  0.513213  0.365172
18  0.612632  0.134256  0.947726  0.176472
19  0.945975  0.776308  0.506646  0.008831

In [24]:
dflookup.lookup(list(range(0,10,2)), ['B','C','A','B','D']) #will return an array

array([0.96089946, 0.3398659 , 0.71284659, 0.12510827, 0.37385828])

In [3]:

index = pd.Index(['e','d','a','b']);index

Index(['e', 'd', 'a', 'b'], dtype='object')

In [4]:
index = pd.Index(['e','d','a','b'],name = 'something')

In [5]:
index.name

'something'

In [6]:
index = pd.Index(list(range(5)), name = 'rows')
columns = pd.Index(['A','B','C'], name = 'cols')

In [9]:
df = pd.DataFrame(np.random.randn(5,3), index = index, columns=columns); df

cols         A         B         C
rows
0     0.166796 -0.902713  0.080803
1     1.339229  0.675863 -0.905111
2    -0.248519  0.763690  0.783646
3     1.545876 -1.235275 -0.134784
4    -0.504181 -0.387186 -0.573915

In [10]:
df['A']

rows
0    0.166796
1    1.339229
2   -0.248519
3    1.545876
4   -0.504181
Name: A, dtype: float64

In [11]:
df.A

rows
0    0.166796
1    1.339229
2   -0.248519
3    1.545876
4   -0.504181
Name: A, dtype: float64

In [12]:
df.loc[:,'A']

rows
0    0.166796
1    1.339229
2   -0.248519
3    1.545876
4   -0.504181
Name: A, dtype: float64

In [13]:
df[lambda x: 'A']

rows
0    0.166796
1    1.339229
2   -0.248519
3    1.545876
4   -0.504181
Name: A, dtype: float64

In [14]:
#setting metadata
ind = pd.Index([1,2])

In [15]:
ind

Int64Index([1, 2], dtype='int64')

In [16]:
ind.rename("apple")

Int64Index([1, 2], dtype='int64', name='apple')

In [17]:
#set names
ind.set_names(["apple"],inplace=True); ind

Int64Index([1, 2], dtype='int64', name='apple')

In [18]:
ind.name = 'bob'; ind

Int64Index([1, 2], dtype='int64', name='bob')

In [2]:
#setting -- set_names, set_levels and set_labels
index = pd.MultiIndex.from_product([(range(3)), ['one', 'two']])
index

MultiIndex(levels=[[0, 1, 2], ['one', 'two']],
           labels=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]])

In [22]:
index.levels

FrozenList([[0, 1, 2], ['one', 'two']])

In [23]:
index.names

FrozenList([None, None])

In [24]:
index.labels

FrozenList([[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]])

In [3]:
index.levels[1]

Index(['one', 'two'], dtype='object')

In [4]:
index.levels[0]

Int64Index([0, 1, 2], dtype='int64')

In [5]:
index.set_levels(["a", "b"],level=1)

MultiIndex(levels=[[0, 1, 2], ['a', 'b']],
           labels=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]])

In [6]:
index.labels[0]

FrozenNDArray([0, 0, 1, 1, 2, 2], dtype='int8')

In [7]:
#set operations on index objects
a = pd.Index(['c', 'b', 'a'])
b = pd.Index(['c', 'e', 'd'])

In [8]:
a | b

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [9]:
a.union(b)

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [10]:
a & b

Index(['c'], dtype='object')

In [11]:
a.difference(b)

Index(['a', 'b'], dtype='object')

In [12]:
#missing values
indx = pd.Index([1, np.nan, 3,4])
indx

Float64Index([1.0, nan, 3.0, 4.0], dtype='float64')

In [14]:
indx.fillna(2)

Float64Index([1.0, 2.0, 3.0, 4.0], dtype='float64')

In [15]:
idx2 = pd.DataFrame([pd.Timestamp('2018-01-01'), pd.NaT, pd.Timestamp('2018-01-03')]); idx2

           0
0 2018-01-01
1        NaT
2 2018-01-03

In [16]:
idx2.fillna(pd.Timestamp('2018-01-02'))

           0
0 2018-01-01
1 2018-01-02
2 2018-01-03

In [19]:
#setting and resetting index
data = pd.DataFrame(np.array([['bar', 'one', 'z', 7.0],
                              ['bar', 'two', 'y', 2.0],
                              ['foo', 'one', 'x', 3.0],
                              ['foo', 'two', 'w', 4.0]]),columns = list('abcd'))

In [20]:
data

     a    b  c    d
0  bar  one  z  7.0
1  bar  two  y  2.0
2  foo  one  x  3.0
3  foo  two  w  4.0

In [21]:
data.set_index('c')

     a    b    d
c
z  bar  one  7.0
y  bar  two  2.0
x  foo  one  3.0
w  foo  two  4.0

In [23]:
data.set_index(['a', 'b'])

         c    d
a   b
bar one  z  7.0
    two  y  2.0
foo one  x  3.0
    two  w  4.0

In [26]:
data.query('a == "bar"')

     a    b  c    d
0  bar  one  z  7.0
1  bar  two  y  2.0

In [27]:
frame = data.set_index('c', drop=False)

In [28]:
frame = frame.set_index(['a', 'b'], append=True); frame

           c    d
c a   b
z bar one  z  7.0
y bar two  y  2.0
x foo one  x  3.0
w foo two  w  4.0

In [29]:
data.set_index('c', drop=False)

     a    b  c    d
c
z  bar  one  z  7.0
y  bar  two  y  2.0
x  foo  one  x  3.0
w  foo  two  w  4.0

In [30]:
data.set_index(['a', 'b'], inplace=True)

In [31]:
data

         c    d
a   b
bar one  z  7.0
    two  y  2.0
foo one  x  3.0
    two  w  4.0

In [32]:
data.reset_index()

     a    b  c    d
0  bar  one  z  7.0
1  bar  two  y  2.0
2  foo  one  x  3.0
3  foo  two  w  4.0

In [33]:
frame.reset_index(level=1)

         a  c    d
c b
z one  bar  z  7.0
y two  bar  y  2.0
x one  foo  x  3.0
w two  foo  w  4.0